HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** \\brief  2068, Message Object  Interrupt Pointer Register */
#define CAN_MO131_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A068u)

/** Alias (User Manual Name) for CAN_MO131_IPR.
* To use register names with standard convension, please use CAN_MO131_IPR.
*/
#define	CAN_MOIPR131	(CAN_MO131_IPR)

/** \\brief  207C, Message Object  Control Register */
#define CAN_MO131_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A07Cu)

/** Alias (User Manual Name) for CAN_MO131_STAT.
* To use register names with standard convension, please use CAN_MO131_STAT.
*/
#define	CAN_MOSTAT131	(CAN_MO131_STAT)

/** \\brief  208C, Message Object  Acceptance Mask Register */
#define CAN_MO132_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A08Cu)

/** Alias (User Manual Name) for CAN_MO132_AMR.
* To use register names with standard convension, please use CAN_MO132_AMR.
*/
#define	CAN_MOAMR132	(CAN_MO132_AMR)

/** \\brief  2098, Message Object  Arbitration Register */
#define CAN_MO132_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A098u)

/** Alias (User Manual Name) for CAN_MO132_AR.
* To use register names with standard convension, please use CAN_MO132_AR.
*/
#define	CAN_MOAR132	(CAN_MO132_AR)

/** \\brief  209C, Message Object  Control Register */
#define CAN_MO132_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A09Cu)

/** Alias (User Manual Name) for CAN_MO132_CTR.
* To use register names with standard convension, please use CAN_MO132_CTR.
*/
#define	CAN_MOCTR132	(CAN_MO132_CTR)

/** \\brief  2094, Message Object  Data Register High */
#define CAN_MO132_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A094u)

/** Alias (User Manual Name) for CAN_MO132_DATAH.
* To use register names with standard convension, please use CAN_MO132_DATAH.
*/
#define	CAN_MODATAH132	(CAN_MO132_DATAH)

/** \\brief  2090, Message Object  Data Register Low */
#define CAN_MO132_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A090u)

/** Alias (User Manual Name) for CAN_MO132_DATAL.
* To use register names with standard convension, please use CAN_MO132_DATAL.
*/
#define	CAN_MODATAL132	(CAN_MO132_DATAL)

/** \\brief  2080, Message Object  Function Control Register */
#define CAN_MO132_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A080u)

/** Alias (User Manual Name) for CAN_MO132_FCR.
* To use register names with standard convension, please use CAN_MO132_FCR.
*/
#define	CAN_MOFCR132	(CAN_MO132_FCR)

/** \\brief  2084, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO132_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A084u)

/** Alias (User Manual Name) for CAN_MO132_FGPR.
* To use register names with standard convension, please use CAN_MO132_FGPR.
*/
#define	CAN_MOFGPR132	(CAN_MO132_FGPR)

/** \\brief  2088, Message Object  Interrupt Pointer Register */
#define CAN_MO132_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A088u)

/** Alias (User Manual Name) for CAN_MO132_IPR.
* To use register names with standard convension, please use CAN_MO132_IPR.
*/
#define	CAN_MOIPR132	(CAN_MO132_IPR)

/** \\brief  209C, Message Object  Control Register */
#define CAN_MO132_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A09Cu)

/** Alias (User Manual Name) for CAN_MO132_STAT.
* To use register names with standard convension, please use CAN_MO132_STAT.
*/
#define	CAN_MOSTAT132	(CAN_MO132_STAT)

/** \\brief  20AC, Message Object  Acceptance Mask Register */
#define CAN_MO133_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0ACu)

/** Alias (User Manual Name) for CAN_MO133_AMR.
* To use register names with standard convension, please use CAN_MO133_AMR.
*/
#define	CAN_MOAMR133	(CAN_MO133_AMR)

/** \\brief  20B8, Message Object  Arbitration Register */
#define CAN_MO133_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0B8u)

/** Alias (User Manual Name) for CAN_MO133_AR.
* To use register names with standard convension, please use CAN_MO133_AR.
*/
#define	CAN_MOAR133	(CAN_MO133_AR)

/** \\brief  20BC, Message Object  Control Register */
#define CAN_MO133_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A0BCu)

/** Alias (User Manual Name) for CAN_MO133_CTR.
* To use register names with standard convension, please use CAN_MO133_CTR.
*/
#define	CAN_MOCTR133	(CAN_MO133_CTR)

/** \\brief  20B4, Message Object  Data Register High */
#define CAN_MO133_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0B4u)

/** Alias (User Manual Name) for CAN_MO133_DATAH.
* To use register names with standard convension, please use CAN_MO133_DATAH.
*/
#define	CAN_MODATAH133	(CAN_MO133_DATAH)

/** \\brief  20B0, Message Object  Data Register Low */
#define CAN_MO133_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0B0u)

/** Alias (User Manual Name) for CAN_MO133_DATAL.
* To use register names with standard convension, please use CAN_MO133_DATAL.
*/
#define	CAN_MODATAL133	(CAN_MO133_DATAL)

/** \\brief  20A0, Message Object  Function Control Register */
#define CAN_MO133_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0A0u)

/** Alias (User Manual Name) for CAN_MO133_FCR.
* To use register names with standard convension, please use CAN_MO133_FCR.
*/
#define	CAN_MOFCR133	(CAN_MO133_FCR)

/** \\brief  20A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO133_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0A4u)

/** Alias (User Manual Name) for CAN_MO133_FGPR.
* To use register names with standard convension, please use CAN_MO133_FGPR.
*/
#define	CAN_MOFGPR133	(CAN_MO133_FGPR)

/** \\brief  20A8, Message Object  Interrupt Pointer Register */
#define CAN_MO133_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0A8u)

/** Alias (User Manual Name) for CAN_MO133_IPR.
* To use register names with standard convension, please use CAN_MO133_IPR.
*/
#define	CAN_MOIPR133	(CAN_MO133_IPR)

/** \\brief  20BC, Message Object  Control Register */
#define CAN_MO133_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A0BCu)

