HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO168_CTR.
* To use register names with standard convension, please use CAN_MO168_CTR.
*/
#define	CAN_MOCTR168	(CAN_MO168_CTR)

/** \\brief  2514, Message Object  Data Register High */
#define CAN_MO168_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A514u)

/** Alias (User Manual Name) for CAN_MO168_DATAH.
* To use register names with standard convension, please use CAN_MO168_DATAH.
*/
#define	CAN_MODATAH168	(CAN_MO168_DATAH)

/** \\brief  2510, Message Object  Data Register Low */
#define CAN_MO168_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A510u)

/** Alias (User Manual Name) for CAN_MO168_DATAL.
* To use register names with standard convension, please use CAN_MO168_DATAL.
*/
#define	CAN_MODATAL168	(CAN_MO168_DATAL)

/** \\brief  2500, Message Object  Function Control Register */
#define CAN_MO168_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A500u)

/** Alias (User Manual Name) for CAN_MO168_FCR.
* To use register names with standard convension, please use CAN_MO168_FCR.
*/
#define	CAN_MOFCR168	(CAN_MO168_FCR)

/** \\brief  2504, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO168_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A504u)

/** Alias (User Manual Name) for CAN_MO168_FGPR.
* To use register names with standard convension, please use CAN_MO168_FGPR.
*/
#define	CAN_MOFGPR168	(CAN_MO168_FGPR)

/** \\brief  2508, Message Object  Interrupt Pointer Register */
#define CAN_MO168_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A508u)

/** Alias (User Manual Name) for CAN_MO168_IPR.
* To use register names with standard convension, please use CAN_MO168_IPR.
*/
#define	CAN_MOIPR168	(CAN_MO168_IPR)

/** \\brief  251C, Message Object  Control Register */
#define CAN_MO168_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A51Cu)

/** Alias (User Manual Name) for CAN_MO168_STAT.
* To use register names with standard convension, please use CAN_MO168_STAT.
*/
#define	CAN_MOSTAT168	(CAN_MO168_STAT)

/** \\brief  252C, Message Object  Acceptance Mask Register */
#define CAN_MO169_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A52Cu)

/** Alias (User Manual Name) for CAN_MO169_AMR.
* To use register names with standard convension, please use CAN_MO169_AMR.
*/
#define	CAN_MOAMR169	(CAN_MO169_AMR)

/** \\brief  2538, Message Object  Arbitration Register */
#define CAN_MO169_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A538u)

/** Alias (User Manual Name) for CAN_MO169_AR.
* To use register names with standard convension, please use CAN_MO169_AR.
*/
#define	CAN_MOAR169	(CAN_MO169_AR)

/** \\brief  253C, Message Object  Control Register */
#define CAN_MO169_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001A53Cu)

/** Alias (User Manual Name) for CAN_MO169_CTR.
* To use register names with standard convension, please use CAN_MO169_CTR.
*/
#define	CAN_MOCTR169	(CAN_MO169_CTR)

/** \\brief  2534, Message Object  Data Register High */
#define CAN_MO169_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A534u)

/** Alias (User Manual Name) for CAN_MO169_DATAH.
* To use register names with standard convension, please use CAN_MO169_DATAH.
*/
#define	CAN_MODATAH169	(CAN_MO169_DATAH)

/** \\brief  2530, Message Object  Data Register Low */
#define CAN_MO169_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A530u)

/** Alias (User Manual Name) for CAN_MO169_DATAL.
* To use register names with standard convension, please use CAN_MO169_DATAL.
*/
#define	CAN_MODATAL169	(CAN_MO169_DATAL)

/** \\brief  2520, Message Object  Function Control Register */
#define CAN_MO169_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A520u)

/** Alias (User Manual Name) for CAN_MO169_FCR.
* To use register names with standard convension, please use CAN_MO169_FCR.
*/
#define	CAN_MOFCR169	(CAN_MO169_FCR)

/** \\brief  2524, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO169_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A524u)

/** Alias (User Manual Name) for CAN_MO169_FGPR.
* To use register names with standard convension, please use CAN_MO169_FGPR.
*/
#define	CAN_MOFGPR169	(CAN_MO169_FGPR)

/** \\brief  2528, Message Object  Interrupt Pointer Register */
#define CAN_MO169_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A528u)

/** Alias (User Manual Name) for CAN_MO169_IPR.
* To use register names with standard convension, please use CAN_MO169_IPR.
*/
#define	CAN_MOIPR169	(CAN_MO169_IPR)

/** \\brief  253C, Message Object  Control Register */
#define CAN_MO169_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001A53Cu)

/** Alias (User Manual Name) for CAN_MO169_STAT.
* To use register names with standard convension, please use CAN_MO169_STAT.
*/
#define	CAN_MOSTAT169	(CAN_MO169_STAT)

/** \\brief  120C, Message Object  Acceptance Mask Register */
#define CAN_MO16_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001920Cu)

/** Alias (User Manual Name) for CAN_MO16_AMR.
* To use register names with standard convension, please use CAN_MO16_AMR.
*/
#define	CAN_MOAMR16	(CAN_MO16_AMR)

/** \\brief  1218, Message Object  Arbitration Register */
#define CAN_MO16_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019218u)

/** Alias (User Manual Name) for CAN_MO16_AR.
* To use register names with standard convension, please use CAN_MO16_AR.
*/
#define	CAN_MOAR16	(CAN_MO16_AR)

/** \\brief  121C, Message Object  Control Register */
#define CAN_MO16_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001921Cu)

/** Alias (User Manual Name) for CAN_MO16_CTR.
* To use register names with standard convension, please use CAN_MO16_CTR.
*/
#define	CAN_MOCTR16	(CAN_MO16_CTR)

/** \\brief  1214, Message Object  Data Register High */
#define CAN_MO16_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019214u)

/** Alias (User Manual Name) for CAN_MO16_DATAH.
* To use register names with standard convension, please use CAN_MO16_DATAH.
*/
#define	CAN_MODATAH16	(CAN_MO16_DATAH)

/** \\brief  1210, Message Object  Data Register Low */
#define CAN_MO16_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019210u)

/** Alias (User Manual Name) for CAN_MO16_DATAL.
* To use register names with standard convension, please use CAN_MO16_DATAL.
*/
#define	CAN_MODATAL16	(CAN_MO16_DATAL)

/** \\brief  1200, Message Object  Function Control Register */
#define CAN_MO16_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019200u)

/** Alias (User Manual Name) for CAN_MO16_FCR.
* To use register names with standard convension, please use CAN_MO16_FCR.
*/
#define	CAN_MOFCR16	(CAN_MO16_FCR)

/** \\brief  1204, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO16_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019204u)

/** Alias (User Manual Name) for CAN_MO16_FGPR.
* To use register names with standard convension, please use CAN_MO16_FGPR.
*/
#define	CAN_MOFGPR16	(CAN_MO16_FGPR)

/** \\brief  1208, Message Object  Interrupt Pointer Register */
#define CAN_MO16_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019208u)

/** Alias (User Manual Name) for CAN_MO16_IPR.
* To use register names with standard convension, please use CAN_MO16_IPR.
*/
#define	CAN_MOIPR16	(CAN_MO16_IPR)

