HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** \\brief  2AB8, Message Object  Arbitration Register */
#define CAN_MO213_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAB8u)

/** Alias (User Manual Name) for CAN_MO213_AR.
* To use register names with standard convension, please use CAN_MO213_AR.
*/
#define	CAN_MOAR213	(CAN_MO213_AR)

/** \\brief  2ABC, Message Object  Control Register */
#define CAN_MO213_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AABCu)

/** Alias (User Manual Name) for CAN_MO213_CTR.
* To use register names with standard convension, please use CAN_MO213_CTR.
*/
#define	CAN_MOCTR213	(CAN_MO213_CTR)

/** \\brief  2AB4, Message Object  Data Register High */
#define CAN_MO213_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAB4u)

/** Alias (User Manual Name) for CAN_MO213_DATAH.
* To use register names with standard convension, please use CAN_MO213_DATAH.
*/
#define	CAN_MODATAH213	(CAN_MO213_DATAH)

/** \\brief  2AB0, Message Object  Data Register Low */
#define CAN_MO213_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAB0u)

/** Alias (User Manual Name) for CAN_MO213_DATAL.
* To use register names with standard convension, please use CAN_MO213_DATAL.
*/
#define	CAN_MODATAL213	(CAN_MO213_DATAL)

/** \\brief  2AA0, Message Object  Function Control Register */
#define CAN_MO213_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AAA0u)

/** Alias (User Manual Name) for CAN_MO213_FCR.
* To use register names with standard convension, please use CAN_MO213_FCR.
*/
#define	CAN_MOFCR213	(CAN_MO213_FCR)

/** \\brief  2AA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO213_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AAA4u)

/** Alias (User Manual Name) for CAN_MO213_FGPR.
* To use register names with standard convension, please use CAN_MO213_FGPR.
*/
#define	CAN_MOFGPR213	(CAN_MO213_FGPR)

/** \\brief  2AA8, Message Object  Interrupt Pointer Register */
#define CAN_MO213_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AAA8u)

/** Alias (User Manual Name) for CAN_MO213_IPR.
* To use register names with standard convension, please use CAN_MO213_IPR.
*/
#define	CAN_MOIPR213	(CAN_MO213_IPR)

/** \\brief  2ABC, Message Object  Control Register */
#define CAN_MO213_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AABCu)

/** Alias (User Manual Name) for CAN_MO213_STAT.
* To use register names with standard convension, please use CAN_MO213_STAT.
*/
#define	CAN_MOSTAT213	(CAN_MO213_STAT)

/** \\brief  2ACC, Message Object  Acceptance Mask Register */
#define CAN_MO214_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AACCu)

/** Alias (User Manual Name) for CAN_MO214_AMR.
* To use register names with standard convension, please use CAN_MO214_AMR.
*/
#define	CAN_MOAMR214	(CAN_MO214_AMR)

/** \\brief  2AD8, Message Object  Arbitration Register */
#define CAN_MO214_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAD8u)

/** Alias (User Manual Name) for CAN_MO214_AR.
* To use register names with standard convension, please use CAN_MO214_AR.
*/
#define	CAN_MOAR214	(CAN_MO214_AR)

/** \\brief  2ADC, Message Object  Control Register */
#define CAN_MO214_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AADCu)

/** Alias (User Manual Name) for CAN_MO214_CTR.
* To use register names with standard convension, please use CAN_MO214_CTR.
*/
#define	CAN_MOCTR214	(CAN_MO214_CTR)

/** \\brief  2AD4, Message Object  Data Register High */
#define CAN_MO214_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAD4u)

/** Alias (User Manual Name) for CAN_MO214_DATAH.
* To use register names with standard convension, please use CAN_MO214_DATAH.
*/
#define	CAN_MODATAH214	(CAN_MO214_DATAH)

/** \\brief  2AD0, Message Object  Data Register Low */
#define CAN_MO214_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAD0u)

/** Alias (User Manual Name) for CAN_MO214_DATAL.
* To use register names with standard convension, please use CAN_MO214_DATAL.
*/
#define	CAN_MODATAL214	(CAN_MO214_DATAL)

/** \\brief  2AC0, Message Object  Function Control Register */
#define CAN_MO214_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AAC0u)

/** Alias (User Manual Name) for CAN_MO214_FCR.
* To use register names with standard convension, please use CAN_MO214_FCR.
*/
#define	CAN_MOFCR214	(CAN_MO214_FCR)

/** \\brief  2AC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO214_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AAC4u)

/** Alias (User Manual Name) for CAN_MO214_FGPR.
* To use register names with standard convension, please use CAN_MO214_FGPR.
*/
#define	CAN_MOFGPR214	(CAN_MO214_FGPR)

/** \\brief  2AC8, Message Object  Interrupt Pointer Register */
#define CAN_MO214_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AAC8u)

/** Alias (User Manual Name) for CAN_MO214_IPR.
* To use register names with standard convension, please use CAN_MO214_IPR.
*/
#define	CAN_MOIPR214	(CAN_MO214_IPR)

/** \\brief  2ADC, Message Object  Control Register */
#define CAN_MO214_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AADCu)

/** Alias (User Manual Name) for CAN_MO214_STAT.
* To use register names with standard convension, please use CAN_MO214_STAT.
*/
#define	CAN_MOSTAT214	(CAN_MO214_STAT)

/** \\brief  2AEC, Message Object  Acceptance Mask Register */
#define CAN_MO215_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AAECu)

/** Alias (User Manual Name) for CAN_MO215_AMR.
* To use register names with standard convension, please use CAN_MO215_AMR.
*/
#define	CAN_MOAMR215	(CAN_MO215_AMR)

/** \\brief  2AF8, Message Object  Arbitration Register */
#define CAN_MO215_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AAF8u)

/** Alias (User Manual Name) for CAN_MO215_AR.
* To use register names with standard convension, please use CAN_MO215_AR.
*/
#define	CAN_MOAR215	(CAN_MO215_AR)

/** \\brief  2AFC, Message Object  Control Register */
#define CAN_MO215_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AAFCu)

/** Alias (User Manual Name) for CAN_MO215_CTR.
* To use register names with standard convension, please use CAN_MO215_CTR.
*/
#define	CAN_MOCTR215	(CAN_MO215_CTR)

/** \\brief  2AF4, Message Object  Data Register High */
#define CAN_MO215_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AAF4u)

/** Alias (User Manual Name) for CAN_MO215_DATAH.
* To use register names with standard convension, please use CAN_MO215_DATAH.
*/
#define	CAN_MODATAH215	(CAN_MO215_DATAH)

/** \\brief  2AF0, Message Object  Data Register Low */
#define CAN_MO215_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AAF0u)

/** Alias (User Manual Name) for CAN_MO215_DATAL.
* To use register names with standard convension, please use CAN_MO215_DATAL.
*/
#define	CAN_MODATAL215	(CAN_MO215_DATAL)

/** \\brief  2AE0, Message Object  Function Control Register */
#define CAN_MO215_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AAE0u)

