HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO238_DATAH.
* To use register names with standard convension, please use CAN_MO238_DATAH.
*/
#define	CAN_MODATAH238	(CAN_MO238_DATAH)

/** \\brief  2DD0, Message Object  Data Register Low */
#define CAN_MO238_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADD0u)

/** Alias (User Manual Name) for CAN_MO238_DATAL.
* To use register names with standard convension, please use CAN_MO238_DATAL.
*/
#define	CAN_MODATAL238	(CAN_MO238_DATAL)

/** \\brief  2DC0, Message Object  Function Control Register */
#define CAN_MO238_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADC0u)

/** Alias (User Manual Name) for CAN_MO238_FCR.
* To use register names with standard convension, please use CAN_MO238_FCR.
*/
#define	CAN_MOFCR238	(CAN_MO238_FCR)

/** \\brief  2DC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO238_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADC4u)

/** Alias (User Manual Name) for CAN_MO238_FGPR.
* To use register names with standard convension, please use CAN_MO238_FGPR.
*/
#define	CAN_MOFGPR238	(CAN_MO238_FGPR)

/** \\brief  2DC8, Message Object  Interrupt Pointer Register */
#define CAN_MO238_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADC8u)

/** Alias (User Manual Name) for CAN_MO238_IPR.
* To use register names with standard convension, please use CAN_MO238_IPR.
*/
#define	CAN_MOIPR238	(CAN_MO238_IPR)

/** \\brief  2DDC, Message Object  Control Register */
#define CAN_MO238_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ADDCu)

/** Alias (User Manual Name) for CAN_MO238_STAT.
* To use register names with standard convension, please use CAN_MO238_STAT.
*/
#define	CAN_MOSTAT238	(CAN_MO238_STAT)

/** \\brief  2DEC, Message Object  Acceptance Mask Register */
#define CAN_MO239_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ADECu)

/** Alias (User Manual Name) for CAN_MO239_AMR.
* To use register names with standard convension, please use CAN_MO239_AMR.
*/
#define	CAN_MOAMR239	(CAN_MO239_AMR)

/** \\brief  2DF8, Message Object  Arbitration Register */
#define CAN_MO239_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ADF8u)

/** Alias (User Manual Name) for CAN_MO239_AR.
* To use register names with standard convension, please use CAN_MO239_AR.
*/
#define	CAN_MOAR239	(CAN_MO239_AR)

/** \\brief  2DFC, Message Object  Control Register */
#define CAN_MO239_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001ADFCu)

/** Alias (User Manual Name) for CAN_MO239_CTR.
* To use register names with standard convension, please use CAN_MO239_CTR.
*/
#define	CAN_MOCTR239	(CAN_MO239_CTR)

/** \\brief  2DF4, Message Object  Data Register High */
#define CAN_MO239_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ADF4u)

/** Alias (User Manual Name) for CAN_MO239_DATAH.
* To use register names with standard convension, please use CAN_MO239_DATAH.
*/
#define	CAN_MODATAH239	(CAN_MO239_DATAH)

/** \\brief  2DF0, Message Object  Data Register Low */
#define CAN_MO239_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ADF0u)

/** Alias (User Manual Name) for CAN_MO239_DATAL.
* To use register names with standard convension, please use CAN_MO239_DATAL.
*/
#define	CAN_MODATAL239	(CAN_MO239_DATAL)

/** \\brief  2DE0, Message Object  Function Control Register */
#define CAN_MO239_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ADE0u)

/** Alias (User Manual Name) for CAN_MO239_FCR.
* To use register names with standard convension, please use CAN_MO239_FCR.
*/
#define	CAN_MOFCR239	(CAN_MO239_FCR)

/** \\brief  2DE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO239_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ADE4u)

/** Alias (User Manual Name) for CAN_MO239_FGPR.
* To use register names with standard convension, please use CAN_MO239_FGPR.
*/
#define	CAN_MOFGPR239	(CAN_MO239_FGPR)

/** \\brief  2DE8, Message Object  Interrupt Pointer Register */
#define CAN_MO239_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ADE8u)

/** Alias (User Manual Name) for CAN_MO239_IPR.
* To use register names with standard convension, please use CAN_MO239_IPR.
*/
#define	CAN_MOIPR239	(CAN_MO239_IPR)

/** \\brief  2DFC, Message Object  Control Register */
#define CAN_MO239_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001ADFCu)

/** Alias (User Manual Name) for CAN_MO239_STAT.
* To use register names with standard convension, please use CAN_MO239_STAT.
*/
#define	CAN_MOSTAT239	(CAN_MO239_STAT)

/** \\brief  12EC, Message Object  Acceptance Mask Register */
#define CAN_MO23_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00192ECu)

/** Alias (User Manual Name) for CAN_MO23_AMR.
* To use register names with standard convension, please use CAN_MO23_AMR.
*/
#define	CAN_MOAMR23	(CAN_MO23_AMR)

/** \\brief  12F8, Message Object  Arbitration Register */
#define CAN_MO23_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00192F8u)

/** Alias (User Manual Name) for CAN_MO23_AR.
* To use register names with standard convension, please use CAN_MO23_AR.
*/
#define	CAN_MOAR23	(CAN_MO23_AR)

/** \\brief  12FC, Message Object  Control Register */
#define CAN_MO23_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF00192FCu)

/** Alias (User Manual Name) for CAN_MO23_CTR.
* To use register names with standard convension, please use CAN_MO23_CTR.
*/
#define	CAN_MOCTR23	(CAN_MO23_CTR)

/** \\brief  12F4, Message Object  Data Register High */
#define CAN_MO23_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192F4u)

/** Alias (User Manual Name) for CAN_MO23_DATAH.
* To use register names with standard convension, please use CAN_MO23_DATAH.
*/
#define	CAN_MODATAH23	(CAN_MO23_DATAH)

/** \\brief  12F0, Message Object  Data Register Low */
#define CAN_MO23_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192F0u)

/** Alias (User Manual Name) for CAN_MO23_DATAL.
* To use register names with standard convension, please use CAN_MO23_DATAL.
*/
#define	CAN_MODATAL23	(CAN_MO23_DATAL)

