HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** \\brief  2E94, Message Object  Data Register High */
#define CAN_MO244_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE94u)

/** Alias (User Manual Name) for CAN_MO244_DATAH.
* To use register names with standard convension, please use CAN_MO244_DATAH.
*/
#define	CAN_MODATAH244	(CAN_MO244_DATAH)

/** \\brief  2E90, Message Object  Data Register Low */
#define CAN_MO244_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE90u)

/** Alias (User Manual Name) for CAN_MO244_DATAL.
* To use register names with standard convension, please use CAN_MO244_DATAL.
*/
#define	CAN_MODATAL244	(CAN_MO244_DATAL)

/** \\brief  2E80, Message Object  Function Control Register */
#define CAN_MO244_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE80u)

/** Alias (User Manual Name) for CAN_MO244_FCR.
* To use register names with standard convension, please use CAN_MO244_FCR.
*/
#define	CAN_MOFCR244	(CAN_MO244_FCR)

/** \\brief  2E84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO244_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE84u)

/** Alias (User Manual Name) for CAN_MO244_FGPR.
* To use register names with standard convension, please use CAN_MO244_FGPR.
*/
#define	CAN_MOFGPR244	(CAN_MO244_FGPR)

/** \\brief  2E88, Message Object  Interrupt Pointer Register */
#define CAN_MO244_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE88u)

/** Alias (User Manual Name) for CAN_MO244_IPR.
* To use register names with standard convension, please use CAN_MO244_IPR.
*/
#define	CAN_MOIPR244	(CAN_MO244_IPR)

/** \\brief  2E9C, Message Object  Control Register */
#define CAN_MO244_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AE9Cu)

/** Alias (User Manual Name) for CAN_MO244_STAT.
* To use register names with standard convension, please use CAN_MO244_STAT.
*/
#define	CAN_MOSTAT244	(CAN_MO244_STAT)

/** \\brief  2EAC, Message Object  Acceptance Mask Register */
#define CAN_MO245_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AEACu)

/** Alias (User Manual Name) for CAN_MO245_AMR.
* To use register names with standard convension, please use CAN_MO245_AMR.
*/
#define	CAN_MOAMR245	(CAN_MO245_AMR)

/** \\brief  2EB8, Message Object  Arbitration Register */
#define CAN_MO245_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AEB8u)

/** Alias (User Manual Name) for CAN_MO245_AR.
* To use register names with standard convension, please use CAN_MO245_AR.
*/
#define	CAN_MOAR245	(CAN_MO245_AR)

/** \\brief  2EBC, Message Object  Control Register */
#define CAN_MO245_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AEBCu)

/** Alias (User Manual Name) for CAN_MO245_CTR.
* To use register names with standard convension, please use CAN_MO245_CTR.
*/
#define	CAN_MOCTR245	(CAN_MO245_CTR)

/** \\brief  2EB4, Message Object  Data Register High */
#define CAN_MO245_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AEB4u)

/** Alias (User Manual Name) for CAN_MO245_DATAH.
* To use register names with standard convension, please use CAN_MO245_DATAH.
*/
#define	CAN_MODATAH245	(CAN_MO245_DATAH)

/** \\brief  2EB0, Message Object  Data Register Low */
#define CAN_MO245_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AEB0u)

/** Alias (User Manual Name) for CAN_MO245_DATAL.
* To use register names with standard convension, please use CAN_MO245_DATAL.
*/
#define	CAN_MODATAL245	(CAN_MO245_DATAL)

/** \\brief  2EA0, Message Object  Function Control Register */
#define CAN_MO245_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEA0u)

/** Alias (User Manual Name) for CAN_MO245_FCR.
* To use register names with standard convension, please use CAN_MO245_FCR.
*/
#define	CAN_MOFCR245	(CAN_MO245_FCR)

/** \\brief  2EA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO245_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEA4u)

/** Alias (User Manual Name) for CAN_MO245_FGPR.
* To use register names with standard convension, please use CAN_MO245_FGPR.
*/
#define	CAN_MOFGPR245	(CAN_MO245_FGPR)

/** \\brief  2EA8, Message Object  Interrupt Pointer Register */
#define CAN_MO245_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEA8u)

/** Alias (User Manual Name) for CAN_MO245_IPR.
* To use register names with standard convension, please use CAN_MO245_IPR.
*/
#define	CAN_MOIPR245	(CAN_MO245_IPR)

/** \\brief  2EBC, Message Object  Control Register */
#define CAN_MO245_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AEBCu)

/** Alias (User Manual Name) for CAN_MO245_STAT.
* To use register names with standard convension, please use CAN_MO245_STAT.
*/
#define	CAN_MOSTAT245	(CAN_MO245_STAT)

/** \\brief  2ECC, Message Object  Acceptance Mask Register */
#define CAN_MO246_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AECCu)

/** Alias (User Manual Name) for CAN_MO246_AMR.
* To use register names with standard convension, please use CAN_MO246_AMR.
*/
#define	CAN_MOAMR246	(CAN_MO246_AMR)

/** \\brief  2ED8, Message Object  Arbitration Register */
#define CAN_MO246_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AED8u)

/** Alias (User Manual Name) for CAN_MO246_AR.
* To use register names with standard convension, please use CAN_MO246_AR.
*/
#define	CAN_MOAR246	(CAN_MO246_AR)

/** \\brief  2EDC, Message Object  Control Register */
#define CAN_MO246_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AEDCu)

/** Alias (User Manual Name) for CAN_MO246_CTR.
* To use register names with standard convension, please use CAN_MO246_CTR.
*/
#define	CAN_MOCTR246	(CAN_MO246_CTR)

/** \\brief  2ED4, Message Object  Data Register High */
#define CAN_MO246_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AED4u)

/** Alias (User Manual Name) for CAN_MO246_DATAH.
* To use register names with standard convension, please use CAN_MO246_DATAH.
*/
#define	CAN_MODATAH246	(CAN_MO246_DATAH)

/** \\brief  2ED0, Message Object  Data Register Low */
#define CAN_MO246_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AED0u)

/** Alias (User Manual Name) for CAN_MO246_DATAL.
* To use register names with standard convension, please use CAN_MO246_DATAL.
*/
#define	CAN_MODATAL246	(CAN_MO246_DATAL)

