HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO252_CTR.
* To use register names with standard convension, please use CAN_MO252_CTR.
*/
#define	CAN_MOCTR252	(CAN_MO252_CTR)

/** \\brief  2F94, Message Object  Data Register High */
#define CAN_MO252_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF94u)

/** Alias (User Manual Name) for CAN_MO252_DATAH.
* To use register names with standard convension, please use CAN_MO252_DATAH.
*/
#define	CAN_MODATAH252	(CAN_MO252_DATAH)

/** \\brief  2F90, Message Object  Data Register Low */
#define CAN_MO252_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF90u)

/** Alias (User Manual Name) for CAN_MO252_DATAL.
* To use register names with standard convension, please use CAN_MO252_DATAL.
*/
#define	CAN_MODATAL252	(CAN_MO252_DATAL)

/** \\brief  2F80, Message Object  Function Control Register */
#define CAN_MO252_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF80u)

/** Alias (User Manual Name) for CAN_MO252_FCR.
* To use register names with standard convension, please use CAN_MO252_FCR.
*/
#define	CAN_MOFCR252	(CAN_MO252_FCR)

/** \\brief  2F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO252_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF84u)

/** Alias (User Manual Name) for CAN_MO252_FGPR.
* To use register names with standard convension, please use CAN_MO252_FGPR.
*/
#define	CAN_MOFGPR252	(CAN_MO252_FGPR)

/** \\brief  2F88, Message Object  Interrupt Pointer Register */
#define CAN_MO252_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF88u)

/** Alias (User Manual Name) for CAN_MO252_IPR.
* To use register names with standard convension, please use CAN_MO252_IPR.
*/
#define	CAN_MOIPR252	(CAN_MO252_IPR)

/** \\brief  2F9C, Message Object  Control Register */
#define CAN_MO252_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AF9Cu)

/** Alias (User Manual Name) for CAN_MO252_STAT.
* To use register names with standard convension, please use CAN_MO252_STAT.
*/
#define	CAN_MOSTAT252	(CAN_MO252_STAT)

/** \\brief  2FAC, Message Object  Acceptance Mask Register */
#define CAN_MO253_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFACu)

/** Alias (User Manual Name) for CAN_MO253_AMR.
* To use register names with standard convension, please use CAN_MO253_AMR.
*/
#define	CAN_MOAMR253	(CAN_MO253_AMR)

/** \\brief  2FB8, Message Object  Arbitration Register */
#define CAN_MO253_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFB8u)

/** Alias (User Manual Name) for CAN_MO253_AR.
* To use register names with standard convension, please use CAN_MO253_AR.
*/
#define	CAN_MOAR253	(CAN_MO253_AR)

/** \\brief  2FBC, Message Object  Control Register */
#define CAN_MO253_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AFBCu)

/** Alias (User Manual Name) for CAN_MO253_CTR.
* To use register names with standard convension, please use CAN_MO253_CTR.
*/
#define	CAN_MOCTR253	(CAN_MO253_CTR)

/** \\brief  2FB4, Message Object  Data Register High */
#define CAN_MO253_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFB4u)

/** Alias (User Manual Name) for CAN_MO253_DATAH.
* To use register names with standard convension, please use CAN_MO253_DATAH.
*/
#define	CAN_MODATAH253	(CAN_MO253_DATAH)

/** \\brief  2FB0, Message Object  Data Register Low */
#define CAN_MO253_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFB0u)

/** Alias (User Manual Name) for CAN_MO253_DATAL.
* To use register names with standard convension, please use CAN_MO253_DATAL.
*/
#define	CAN_MODATAL253	(CAN_MO253_DATAL)

/** \\brief  2FA0, Message Object  Function Control Register */
#define CAN_MO253_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFA0u)

/** Alias (User Manual Name) for CAN_MO253_FCR.
* To use register names with standard convension, please use CAN_MO253_FCR.
*/
#define	CAN_MOFCR253	(CAN_MO253_FCR)

/** \\brief  2FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO253_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFA4u)

/** Alias (User Manual Name) for CAN_MO253_FGPR.
* To use register names with standard convension, please use CAN_MO253_FGPR.
*/
#define	CAN_MOFGPR253	(CAN_MO253_FGPR)

/** \\brief  2FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO253_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFA8u)

/** Alias (User Manual Name) for CAN_MO253_IPR.
* To use register names with standard convension, please use CAN_MO253_IPR.
*/
#define	CAN_MOIPR253	(CAN_MO253_IPR)

/** \\brief  2FBC, Message Object  Control Register */
#define CAN_MO253_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_STAT*)0xF001AFBCu)

/** Alias (User Manual Name) for CAN_MO253_STAT.
* To use register names with standard convension, please use CAN_MO253_STAT.
*/
#define	CAN_MOSTAT253	(CAN_MO253_STAT)

/** \\brief  2FCC, Message Object  Acceptance Mask Register */
#define CAN_MO254_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFCCu)

/** Alias (User Manual Name) for CAN_MO254_AMR.
* To use register names with standard convension, please use CAN_MO254_AMR.
*/
#define	CAN_MOAMR254	(CAN_MO254_AMR)

/** \\brief  2FD8, Message Object  Arbitration Register */
#define CAN_MO254_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFD8u)

/** Alias (User Manual Name) for CAN_MO254_AR.
* To use register names with standard convension, please use CAN_MO254_AR.
*/
#define	CAN_MOAR254	(CAN_MO254_AR)

/** \\brief  2FDC, Message Object  Control Register */
#define CAN_MO254_CTR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR*)0xF001AFDCu)

/** Alias (User Manual Name) for CAN_MO254_CTR.
* To use register names with standard convension, please use CAN_MO254_CTR.
*/
#define	CAN_MOCTR254	(CAN_MO254_CTR)

/** \\brief  2FD4, Message Object  Data Register High */
#define CAN_MO254_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFD4u)

/** Alias (User Manual Name) for CAN_MO254_DATAH.
* To use register names with standard convension, please use CAN_MO254_DATAH.
*/
#define	CAN_MODATAH254	(CAN_MO254_DATAH)

/** \\brief  2FD0, Message Object  Data Register Low */
#define CAN_MO254_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFD0u)

/** Alias (User Manual Name) for CAN_MO254_DATAL.
* To use register names with standard convension, please use CAN_MO254_DATAL.
*/
#define	CAN_MODATAL254	(CAN_MO254_DATAL)

